/*
 * arch/arm/mach-comip/suspend.c
 *
 * CPU pm suspend & resume functions for comip SoCs
 *
 * Copyright (c) 2012, LC Corporation.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 */

#include <linux/kernel.h>
#include <linux/init.h>
#include <linux/io.h>
#include <linux/sched.h>
#include <linux/smp.h>
#include <linux/interrupt.h>
#include <linux/clk.h>
#include <linux/err.h>
#include <linux/debugfs.h>
#include <linux/delay.h>
#include <linux/suspend.h>
#include <linux/slab.h>
#include <linux/serial_reg.h>
#include <linux/seq_file.h>
#include <linux/uaccess.h>
#include <linux/irq.h>
#include <linux/regulator/machine.h>

#include <asm/sections.h>
#include <asm/cacheflush.h>
#include <asm/hardware/cache-l2x0.h>
#include <asm/hardware/gic.h>
#include <asm/localtimer.h>
#include <asm/pgalloc.h>
#include <asm/tlbflush.h>
#include <asm/smp_scu.h>
#include <asm/idmap.h>

#include <mach/iomap.h>
#include <mach/irqs.h>
#include <mach/suspend.h>
#include <plat/hardware.h>
#include <plat/bootinfo.h>

#define COMIP_SUSP_DEBUG 1
#if COMIP_SUSP_DEBUG
#define CPUSUSP_PR(fmt, args...)	printk(KERN_INFO fmt, ## args)
#else
#define CPUSUSP_PR(fmt, args...)	printk(KERN_DEBUG fmt, ## args)
#endif

#define DDR_TO_SRAM(f)	((sram_base) + ((f) - (ddr_base)))

#define symbol_fixed_ddr(sym, value) \
	do { \
		*(u32 *)sym = (u32)io_v2p(DDR_TO_SRAM(value)); \
	} while (0)

#define symbol_fixed_sram(sym, value) \
	do { \
		void *tmp; \
		tmp = (void *)DDR_TO_SRAM(sym); \
		*(u32 *)tmp = (u32)io_v2p(DDR_TO_SRAM(value)); \
	} while (0)

#define COMIP_SRAM_SZ	(0x1000)
#define COMIP_SRAM_PA	(AP_SEC_RAM_BASE + 0x20000 - COMIP_SRAM_SZ)

#define REG_VADDR(reg)	((base_addr) + reg)

#define A9_PRIVATE_TIMERS_OFFSET	0x600

/*scu registers*/
#define SCU_CTRL			0x00
#define SCU_INVALIDATE			0x0c
#define SCU_FILTER_START		0x40
#define SCU_FILTER_END			0x44

/*
 * Maximum size of each item of context, in bytes
 * We round these up to 32 bytes to preserve cache-line alignment
 */
#define PMU_DATA_SIZE			128
#define TIMER_DATA_SIZE			128
#define VFP_DATA_SIZE			288
#define GIC_INTERFACE_DATA_SIZE		64
#define GIC_DIST_PRIVATE_DATA_SIZE	96
#define BANKED_REGISTERS_SIZE		128
#define CP15_DATA_SIZE			64
#define DEBUG_DATA_SIZE			1024
#define MMU_DATA_SIZE			64
#define OTHER_DATA_SIZE			32

#define GIC_DIST_SHARED_DATA_SIZE	2592
#define SCU_DATA_SIZE			32
#define L2_DATA_SIZE			256
#define GLOBAL_TIMER_DATA_SIZE		128

/*offset of private registers*/
struct a9_timer_registers{
	/* 0x00 */ u32 timer_load;
	/* 0x04 */ u32 timer_counter;
	/* 0x08 */ u32 timer_control;
	/* 0x0c */ u32 timer_interrupt_status;
			s8 padding1[0x10];
	/* 0x20 */ u32 watchdog_load;
	/* 0x24 */ u32 watchdog_counter;
	/* 0x28 */ u32 watchdog_control;
	/* 0x2c */ u32 watchdog_interrupt_status;
	/* 0x30 */ u32 watchdog_reset_status;
	/* 0x34 */ u32 watchdog_disable;
} ;

struct a9_scu_context {
	u32 control;
	u32 filtering_start;
	u32 filtering_end;
	u32 access_control;
	u32 ns_access_control;
};

struct a9_pl310_context {
	u32 control;
	u32 aux_control;
	u32 tag_ram_control;
	u32 data_ram_control;
	u32 prefetch_ctrl;
	u32 power_ctrl;
};

struct gic_dis_share_context {
	u32 enable[DIV_ROUND_UP(1020, 32)];
	u32 conf[DIV_ROUND_UP(1020, 16)];
	u32 pri[DIV_ROUND_UP(1020, 4)];
	u32 target[DIV_ROUND_UP(1020, 4)];
	u32 control;
};

struct gic_dis_private_context {
	u32 enable[1];
	u32 conf[2];
	u32 pri[8];
};

struct gic_interface_context {
	u32 control;
	u32 priority_mask;
	u32 binary_point;
};

struct a9_private_timer_context{
	u32 timer_load;
	u32 timer_counter;
	u32 timer_control;
	u32 timer_interrupt_status;
	u32 watchdog_load;
	u32 watchdog_counter;
	u32 watchdog_control;
	u32 watchdog_interrupt_status;
} ;

struct ap_cpu_context{
	u32 endianness;
	u32 actlr;
	u32 sctlr;
	u32 cpacr;
	u32 flags;
	u32 saved_items;
